src/Enums/РолиУчастниковКаналовОбсуждений/РолиУчастниковКаналовОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиУчастниковКаналовОбсуждений</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Автор</name>
  </enumValues>
  <enumValues>
    <name>Читатель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КаналыОбсуждений/КаналыОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаналыОбсуждений</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательДляСВ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФотографии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиУчастниковКаналовОбсуждений</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>DefinedType.КонтейнерПользователей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/КаналыОбсужденийВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеПользователя(Знач ИдентификаторСообщения, Знач ИдентификаторОбсуждения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОбОбсуждении = КаналыОбсуждений.ДанныеОбОбсуждении(ИдентификаторОбсуждения);
	Если Не ДанныеОбОбсуждении.ЭтоОбсуждениеТекущегоПользователяСКаналом Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеОбОбсуждении.КаналПометкаУдаления
		Или Не ЗначениеЗаполнено(ДанныеОбОбсуждении.РольТекущегоПользователяНаКанале)
		Или ДанныеОбОбсуждении.РольТекущегоПользователяНаКанале = Перечисления.РолиУчастниковКаналовОбсуждений.Читатель Тогда
		
		ШрифтНаклонный = Новый Шрифт(,,, Истина);
		ЦветСерый = ЦветаСтиля.ЦветСлужебнойНадписиОбсуждений;
		ЦветСсылки = ЦветаСтиля.ИнформационнаяНадпись;
		
		ЧастиСообщения = Новый Массив;
		Если ДанныеОбОбсуждении.КаналПометкаУдаления Тогда
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Сообщение не будет опубликовано, так как этот '"), ШрифтНаклонный, ЦветСерый));
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'канал'"),
				ШрифтНаклонный, ЦветСсылки,, ПолучитьНавигационнуюСсылку(ДанныеОбОбсуждении.Канал)));
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = ' помечен на удаление'"), ШрифтНаклонный, ЦветСерый));
		Иначе
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Вы не являетесь автором '"), ШрифтНаклонный, ЦветСерый));
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'канала'"),
				ШрифтНаклонный, ЦветСсылки,, ПолучитьНавигационнуюСсылку(ДанныеОбОбсуждении.Канал)));
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = ', поэтому сообщение не будет опубликовано. Чтобы публиковать сообщения, обратитесь к администратору.'"),
				ШрифтНаклонный, ЦветСерый));
		КонецЕсли;
		
		Сообщение = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения);
		Сообщение.Автор = ОбсужденияДокументооборот.ИдентификаторПользователяСВ(
			ДанныеОбОбсуждении.КаналПользователь);
		Сообщение.Получатели.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя());
		Сообщение.Текст = Новый ФорматированнаяСтрока(ЧастиСообщения);
		Сообщение.Записать();
		
		Возврат;
		
	КонецЕсли;
	
	// Пересылка сообщения.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.КаналыОбсуждений.Участники КАК КаналыОбсужденийУчастники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиВКонтейнерах КАК ПользователиВКонтейнерах
		|		ПО КаналыОбсужденийУчастники.Участник = ПользователиВКонтейнерах.Контейнер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ПользователиВКонтейнерах.Пользователь = Пользователи.Ссылка
		|		
		|ГДЕ
		|	КаналыОбсужденийУчастники.Ссылка = &Канал
		|	И НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен
		|	И НЕ Пользователи.Служебный
		|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойИдентификатор
		|	И Пользователи.Ссылка <> &ТекущийПользователь
		|");
	
	Запрос.УстановитьПараметр("Канал", ДанныеОбОбсуждении.Канал);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ПустойИдентификатор", УникальныйИдентификаторПустой());
	
	Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторПользователяИБ");
	
	ПараметрыВыполненияФЗ = Новый Массив;
	ПараметрыВыполненияФЗ.Добавить(Строка(ИдентификаторСообщения));
	ПараметрыВыполненияФЗ.Добавить(Получатели);
	ПараметрыВыполненияФЗ.Добавить(ДанныеОбОбсуждении.Канал);
	ПараметрыВыполненияФЗ.Добавить(ДанныеОбОбсуждении.КаналПользователь);
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(
		"КаналыОбсуждений.ОпубликоватьСообщениеПользователя",
		ПараметрыВыполненияФЗ,
		Строка(ИдентификаторСообщения),
		НСтр("ru = 'Публикация сообщения на канале'"));
	
КонецПроцедуры

#КонецОбласти
